Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E8E.atdf
      <value-group caption="" name="AES_MR__KEYSIZE">
        <value caption="AES Key Size is 128 bits" name="AES128" value="0x0"/>
        <value caption="AES Key Size is 192 bits" name="AES192" value="0x1"/>
        <value caption="AES Key Size is 256 bits" name="AES256" value="0x2"/>
      </value-group>
      <value-group caption="" name="AES_MR__OPMOD">
        <value caption="ECB: Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="CBC: Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="OFB: Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="CFB: Cipher Feedback mode" name="CFB" value="0x3"/>
        <value caption="CTR: Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
      </value-group>
      <value-group caption="" name="AES_MR__CFBS">
        <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
        <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
      </value-group>
      <value-group caption="" name="AES_ISR__URAT">
        <value caption="Input Data Register written during the data processing when SMOD=0x2 mode." name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data Register read during the data processing." name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode Register written during the data processing." name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data Register read during the sub-keys generation." name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode Register written during the sub-keys generation." name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access." name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
    </module>
    <module name="AFEC" caption="Analog-Front-End Controller" id="11147" version="A">
      <register-group name="AFEC"><register caption="Control Register" name="AFE_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Automatic Calibration of AFE" mask="0x00000008" name="AUTOCAL"/>
        </register>
        <register caption="Mode Register" name="AFE_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="AFE_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="AFE_MR__TRGSEL"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="AFE_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="AFE_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="AFE_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="AFE_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="AFE_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="AFE_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="AFE_MR__USEQ"/>
        </register>
        <register caption="Extended Mode Register" name="AFE_EMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="AFE_EMR__CMPMODE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F8" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Resolution" mask="0x00070000" name="RES" values="AFE_EMR__RES"/>
          <bitfield caption="TAG of AFE_LDCR register" mask="0x01000000" name="TAG"/>
          <bitfield caption="Single Trigger Mode" mask="0x02000000" name="STM"/>
        </register>
        <register caption="Channel Sequence 1 Register" name="AFE_SEQ1R" offset="0x0C" rw="RW" size="4">
          <bitfield caption="User Sequence Number 0" mask="0x0000000F" name="USCH0"/>
          <bitfield caption="User Sequence Number 1" mask="0x000000F0" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x00000F00" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x0000F000" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x000F0000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x00F00000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x0F000000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0xF0000000" name="USCH7"/>
        </register>
        <register caption="Channel Sequence 2 Register" name="AFE_SEQ2R" offset="0x10" rw="RW" size="4">
          <bitfield caption="User Sequence Number 8" mask="0x0000000F" name="USCH8"/>
          <bitfield caption="User Sequence Number 9" mask="0x000000F0" name="USCH9"/>
          <bitfield caption="User Sequence Number 10" mask="0x00000F00" name="USCH10"/>
          <bitfield caption="User Sequence Number 11" mask="0x0000F000" name="USCH11"/>
          <bitfield caption="User Sequence Number 12" mask="0x000F0000" name="USCH12"/>
          <bitfield caption="User Sequence Number 13" mask="0x00F00000" name="USCH13"/>
          <bitfield caption="User Sequence Number 14" mask="0x0F000000" name="USCH14"/>
          <bitfield caption="User Sequence Number 15" mask="0xF0000000" name="USCH15"/>
        </register>
        <register caption="Channel Enable Register" name="AFE_CHER" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Enable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Enable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Enable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Enable" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Enable" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Enable" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Enable" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Enable" mask="0x00008000" name="CH15"/>
          <bitfield caption="Channel 16 Enable" mask="0x00010000" name="CH16"/>
          <bitfield mask="0x00020000" name="DIFF17"/>
          <bitfield caption="Channel 18 Enable" mask="0x00040000" name="CH18"/>
          <bitfield caption="Channel 19 Enable" mask="0x00080000" name="CH19"/>
          <bitfield caption="Channel 20 Enable" mask="0x00100000" name="CH20"/>
          <bitfield caption="Channel 21 Enable" mask="0x00200000" name="CH21"/>
          <bitfield caption="Channel 22 Enable" mask="0x00400000" name="CH22"/>
          <bitfield caption="Channel 23 Enable" mask="0x00800000" name="CH23"/>
        </register>
        <register caption="Channel Disable Register" name="AFE_CHDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Disable" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Disable" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Disable" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Disable" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Disable" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Disable" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Disable" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Disable" mask="0x00008000" name="CH15"/>
          <bitfield caption="Channel 16 Disable" mask="0x00010000" name="CH16"/>
          <bitfield mask="0x00020000" name="DIFF17"/>
          <bitfield caption="Channel 18 Disable" mask="0x00040000" name="CH18"/>
          <bitfield caption="Channel 19 Disable" mask="0x00080000" name="CH19"/>
          <bitfield caption="Channel 20 Disable" mask="0x00100000" name="CH20"/>
          <bitfield caption="Channel 21 Disable" mask="0x00200000" name="CH21"/>
          <bitfield caption="Channel 22 Disable" mask="0x00400000" name="CH22"/>
          <bitfield caption="Channel 23 Disable" mask="0x00800000" name="CH23"/>
        </register>
        <register caption="Channel Status Register" name="AFE_CHSR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
          <bitfield caption="Channel 8 Status" mask="0x00000100" name="CH8"/>
          <bitfield caption="Channel 9 Status" mask="0x00000200" name="CH9"/>
          <bitfield caption="Channel 10 Status" mask="0x00000400" name="CH10"/>
          <bitfield caption="Channel 11 Status" mask="0x00000800" name="CH11"/>
          <bitfield caption="Channel 12 Status" mask="0x00001000" name="CH12"/>
          <bitfield caption="Channel 13 Status" mask="0x00002000" name="CH13"/>
          <bitfield caption="Channel 14 Status" mask="0x00004000" name="CH14"/>
          <bitfield caption="Channel 15 Status" mask="0x00008000" name="CH15"/>
          <bitfield caption="Channel 16 Status" mask="0x00010000" name="CH16"/>
          <bitfield mask="0x00020000" name="DIFF17"/>
          <bitfield caption="Channel 18 Status" mask="0x00040000" name="CH18"/>
          <bitfield caption="Channel 19 Status" mask="0x00080000" name="CH19"/>
          <bitfield caption="Channel 20 Status" mask="0x00100000" name="CH20"/>
          <bitfield caption="Channel 21 Status" mask="0x00200000" name="CH21"/>
          <bitfield caption="Channel 22 Status" mask="0x00400000" name="CH22"/>
          <bitfield caption="Channel 23 Status" mask="0x00800000" name="CH23"/>
        </register>
        <register caption="Last Converted Data Register" name="AFE_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x0000FFFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0F000000" name="CHNB"/>
        </register>
        <register caption="Interrupt Enable Register" name="AFE_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Enable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Enable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Enable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Enable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Enable 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Enable 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Enable 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Enable 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="End of Conversion Interrupt Enable 16" mask="0x00010000" name="EOC16"/>
          <bitfield caption="End of Conversion Interrupt Enable 17" mask="0x00020000" name="EOC17"/>
          <bitfield caption="End of Conversion Interrupt Enable 18" mask="0x00040000" name="EOC18"/>
          <bitfield caption="End of Conversion Interrupt Enable 19" mask="0x00080000" name="EOC19"/>
          <bitfield caption="End of Conversion Interrupt Enable 20" mask="0x00100000" name="EOC20"/>
          <bitfield caption="End of Conversion Interrupt Enable 21" mask="0x00200000" name="EOC21"/>
          <bitfield caption="End of Conversion Interrupt Enable 22" mask="0x00400000" name="EOC22"/>
          <bitfield caption="End of Conversion Interrupt Enable 23" mask="0x00800000" name="EOC23"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable+" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
          <bitfield caption="Temperature Change Interrupt Enable" mask="0x40000000" name="TEMPCHG"/>
          <bitfield caption="End of Calibration Sequence Interrupt Enable" mask="0x80000000" name="EOCAL"/>
        </register>
        <register caption="Interrupt Disable Register" name="AFE_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Disable 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Disable 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Disable 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Disable 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Disable 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Disable 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Disable 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Disable 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="End of Conversion Interrupt Disable 16" mask="0x00010000" name="EOC16"/>
          <bitfield caption="End of Conversion Interrupt Disable 17" mask="0x00020000" name="EOC17"/>
          <bitfield caption="End of Conversion Interrupt Disable 18" mask="0x00040000" name="EOC18"/>
          <bitfield caption="End of Conversion Interrupt Disable 19" mask="0x00080000" name="EOC19"/>
          <bitfield caption="End of Conversion Interrupt Disable 20" mask="0x00100000" name="EOC20"/>
          <bitfield caption="End of Conversion Interrupt Disable 21" mask="0x00200000" name="EOC21"/>
          <bitfield caption="End of Conversion Interrupt Disable 22" mask="0x00400000" name="EOC22"/>
          <bitfield caption="End of Conversion Interrupt Disable 23" mask="0x00800000" name="EOC23"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
          <bitfield caption="Temperature Change Interrupt Disable" mask="0x40000000" name="TEMPCHG"/>
          <bitfield caption="End of Calibration Sequence Interrupt Disable" mask="0x80000000" name="EOCAL"/>
        </register>
        <register caption="Interrupt Mask Register" name="AFE_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="End of Conversion Interrupt Mask 8" mask="0x00000100" name="EOC8"/>
          <bitfield caption="End of Conversion Interrupt Mask 9" mask="0x00000200" name="EOC9"/>
          <bitfield caption="End of Conversion Interrupt Mask 10" mask="0x00000400" name="EOC10"/>
          <bitfield caption="End of Conversion Interrupt Mask 11" mask="0x00000800" name="EOC11"/>
          <bitfield caption="End of Conversion Interrupt Mask 12" mask="0x00001000" name="EOC12"/>
          <bitfield caption="End of Conversion Interrupt Mask 13" mask="0x00002000" name="EOC13"/>
          <bitfield caption="End of Conversion Interrupt Mask 14" mask="0x00004000" name="EOC14"/>
          <bitfield caption="End of Conversion Interrupt Mask 15" mask="0x00008000" name="EOC15"/>
          <bitfield caption="End of Conversion Interrupt Mask 16" mask="0x00010000" name="EOC16"/>
          <bitfield caption="End of Conversion Interrupt Mask 17" mask="0x00020000" name="EOC17"/>
          <bitfield caption="End of Conversion Interrupt Mask 18" mask="0x00040000" name="EOC18"/>
          <bitfield caption="End of Conversion Interrupt Mask 19" mask="0x00080000" name="EOC19"/>
          <bitfield caption="End of Conversion Interrupt Mask 20" mask="0x00100000" name="EOC20"/>
          <bitfield caption="End of Conversion Interrupt Mask 21" mask="0x00200000" name="EOC21"/>
          <bitfield caption="End of Conversion Interrupt Mask 22" mask="0x00400000" name="EOC22"/>
          <bitfield caption="End of Conversion Interrupt Mask 23" mask="0x00800000" name="EOC23"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
          <bitfield caption="Temperature Change Interrupt Mask" mask="0x40000000" name="TEMPCHG"/>
          <bitfield caption="End of Calibration Sequence Interrupt Mask" mask="0x80000000" name="EOCAL"/>
        </register>
