Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E8E.atdf
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="2 Kbytes" name="_2K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="AT91SAM9xx Series" name="AT91SAM9xx" value="0x19"/>
        <value caption="AT91SAM9XExx Series" name="AT91SAM9XExx" value="0x29"/>
        <value caption="AT91x34 Series" name="AT91x34" value="0x34"/>
        <value caption="CAP7 Series" name="CAP7" value="0x37"/>
        <value caption="CAP9 Series" name="CAP9" value="0x39"/>
        <value caption="CAP11 Series" name="CAP11" value="0x3B"/>
        <value caption="SAM4E Series" name="SAM4E" value="0x3C"/>
        <value caption="AT91x40 Series" name="AT91x40" value="0x40"/>
        <value caption="AT91x42 Series" name="AT91x42" value="0x42"/>
        <value caption="AT91x43 Series (WLCSP package)" name="AT91x43" value="0x43"/>
        <value caption="AT91x55 Series" name="AT91x55" value="0x55"/>
        <value caption="AT91SAM7Axx Series" name="AT91SAM7Axx" value="0x60"/>
        <value caption="AT91SAM7AQxx Series" name="AT91SAM7AQxx" value="0x61"/>
        <value caption="AT91x63 Series" name="AT91x63" value="0x63"/>
        <value caption="SAM4CxC Series (100-pin version)" name="SAM4CxxC" value="0x64"/>
        <value caption="SAM4CxE Series (144-pin version)" name="SAM4CxxE" value="0x66"/>
        <value caption="AT91SAM7Sxx Series" name="AT91SAM7Sxx" value="0x70"/>
        <value caption="AT91SAM7XCxx Series" name="AT91SAM7XCxx" value="0x71"/>
        <value caption="AT91SAM7SExx Series" name="AT91SAM7SExx" value="0x72"/>
        <value caption="AT91SAM7Lxx Series" name="AT91SAM7Lxx" value="0x73"/>
        <value caption="AT91SAM7Xxx Series" name="AT91SAM7Xxx" value="0x75"/>
        <value caption="AT91SAM7SLxx Series" name="AT91SAM7SLxx" value="0x76"/>
        <value caption="SAM3UxC Series (100-pin version)" name="SAM3UxC" value="0x80"/>
        <value caption="SAM3UxE Series (144-pin version)" name="SAM3UxE" value="0x81"/>
        <value caption="SAM3AxC Series (100-pin version)" name="SAM3AxC" value="0x83"/>
        <value caption="SAM3XxC Series (100-pin version)" name="SAM3XxC" value="0x84"/>
        <value caption="SAM3XxE Series (144-pin version)" name="SAM3XxE" value="0x85"/>
        <value caption="SAM3XxG Series (208/217-pin version)" name="SAM3XxG" value="0x86"/>
        <value caption="SAM3SxASeries (48-pin version)" name="SAM3SxA" value="0x88"/>
        <value caption="SAM4SxA Series (48-pin version)" name="SAM4SxA" value="0x88"/>
        <value caption="SAM3SxB Series (64-pin version)" name="SAM3SxB" value="0x89"/>
        <value caption="SAM4SxB Series (64-pin version)" name="SAM4SxB" value="0x89"/>
        <value caption="SAM3SxC Series (100-pin version)" name="SAM3SxC" value="0x8A"/>
        <value caption="SAM4SxC Series (100-pin version)" name="SAM4SxC" value="0x8A"/>
        <value caption="AT91x92 Series" name="AT91x92" value="0x92"/>
        <value caption="SAM3NxA Series (48-pin version)" name="SAM3NxA" value="0x93"/>
        <value caption="SAM3NxB Series (64-pin version)" name="SAM3NxB" value="0x94"/>
        <value caption="SAM3NxC Series (100-pin version)" name="SAM3NxC" value="0x95"/>
        <value caption="SAM3SDxB Series (64-pin version)" name="SAM3SDxB" value="0x99"/>
        <value caption="SAM3SDxC Series (100-pin version)" name="SAM3SDxC" value="0x9A"/>
        <value caption="SAM5A" name="SAM5A" value="0xA5"/>
        <value caption="SAM4LxA Series (48-pin version)" name="SAM4LxA" value="0xB0"/>
        <value caption="SAM4LxB Series (64-pin version)" name="SAM4LxB" value="0xB1"/>
        <value caption="SAM4LxC Series (100-pin version)" name="SAM4LxC" value="0xB2"/>
        <value caption="AT75Cxx Series" name="AT75Cxx" value="0xF0"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module name="CMCC" caption="Cortex M Cache Controller" id="11108" version="B">
      <register-group name="CMCC"><register caption="Cache Type Register" name="CMCC_TYPE" offset="0x00" rw="R" size="4">
          <bitfield caption="Access Port Access Allowed" mask="0x00000001" name="AP"/>
          <bitfield caption="Dynamic Clock Gating Supported" mask="0x00000002" name="GCLK"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000004" name="RANDP"/>
          <bitfield caption="Least Recently Used Policy Supported" mask="0x00000008" name="LRUP"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000010" name="RRP"/>
          <bitfield caption="Number of Way" mask="0x00000060" name="WAYNUM" values="CMCC_TYPE__WAYNUM"/>
          <bitfield caption="Lock Down Supported" mask="0x00000080" name="LCKDOWN"/>
          <bitfield caption="Cache Size" mask="0x00000700" name="CSIZE" values="CMCC_TYPE__CSIZE"/>
          <bitfield caption="Cache Size" mask="0x00003800" name="CLSIZE" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register caption="Cache Configuration Register" name="CMCC_CFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Disable Clock Gating" mask="0x00000001" name="GCLKDIS"/>
        </register>
        <register caption="Cache Control Register" name="CMCC_CTRL" offset="0x08" rw="W" size="4">
          <bitfield caption="Cache Controller Enable" mask="0x00000001" name="CEN"/>
        </register>
        <register caption="Cache Status Register" name="CMCC_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Cache Controller Status" mask="0x00000001" name="CSTS"/>
        </register>
        <register caption="Cache Maintenance Register 0" name="CMCC_MAINT0" offset="0x20" rw="W" size="4">
          <bitfield caption="Cache Controller Invalidate All" mask="0x00000001" name="INVALL"/>
        </register>
        <register caption="Cache Maintenance Register 1" name="CMCC_MAINT1" offset="0x24" rw="W" size="4">
          <bitfield caption="Invalidate Index" mask="0x000001F0" name="INDEX"/>
          <bitfield caption="Invalidate Way" mask="0xC0000000" name="WAY" values="CMCC_MAINT1__WAY"/>
        </register>
        <register caption="Cache Monitor Configuration Register" name="CMCC_MCFG" offset="0x28" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Counter Mode" mask="0x00000003" name="MODE" values="CMCC_MCFG__MODE"/>
        </register>
        <register caption="Cache Monitor Enable Register" name="CMCC_MEN" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Enable" mask="0x00000001" name="MENABLE"/>
        </register>
