Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E8E.atdf
      <value-group caption="" name="PWM_CAE1__ADEDGM">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAEUPD1__ADEDGMUP">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAE2__ADEDGM">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAEUPD2__ADEDGMUP">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAE3__ADEDGM">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAEUPD3__ADEDGMUP">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
    </module>
    <module name="RSTC" caption="Reset Controller" id="11009" version="C">
      <register-group name="RSTC"><register caption="Control Register" name="RSTC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Processor Reset" mask="0x00000001" name="PROCRST"/>
          <bitfield caption="Peripheral Reset" mask="0x00000004" name="PERRST"/>
          <bitfield caption="External Reset" mask="0x00000008" name="EXTRST"/>
          <bitfield caption="System Reset Key" mask="0xFF000000" name="KEY"/>
        </register>
        <register caption="Status Register" name="RSTC_SR" offset="0x04" rw="R" size="4">
          <bitfield caption="User Reset Status" mask="0x00000001" name="URSTS"/>
          <bitfield caption="Reset Type" mask="0x00000700" name="RSTTYP"/>
          <bitfield caption="NRST Pin Level" mask="0x00010000" name="NRSTL"/>
          <bitfield caption="Software Reset Command in Progress" mask="0x00020000" name="SRCMP"/>
        </register>
        <register caption="Mode Register" name="RSTC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Reset Enable" mask="0x00000001" name="URSTEN"/>
          <bitfield caption="User Reset Interrupt Enable" mask="0x00000010" name="URSTIEN"/>
          <bitfield caption="External Reset Length" mask="0x00000F00" name="ERSTL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY"/>
        </register>
        </register-group>
    </module>
    <module name="RTC" caption="Real-time Clock" id="6056" version="L">
      <register-group name="RTC"><register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="RTCOUT0 Output Source Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="RTCOUT1 Output Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
